''' Задание 1 (базовое). Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.'''

name = input('Введите Ваше имя ')
login = input('Введите Ваш логин ')
password = input('Введите Ваш пароль ')
age = int(input('Введите Ваш возраст '))
print(f"Ваши данные для входа в аккаунт: имя - {name}, логин - {login}, пароль - {password}, возраст - {age}")

